#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04OGI4OWY4Yi1mZmM2LTRkN2EtOGQ2ZS0xZTU5MzM4YzY4NDQ7b2JqZWN0SWQ9ZjFiMmEwYzAtNjMyMS00OThmLWI4NTktNjhiNmY4OWYyMzRiO3N1YnNjcmlwdGlvbklkPTc3YmIwYjA3LTU3ZTUtNDRiNS1hMzUwLTMxMGE5MzkxNzI5ODt0ZW5hbnRJZD1jZTQ3NzVkMy0xYzJlLTQ2NDQtYjJiYy02MzFjMTU3ZDJiZTc=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_conditional_access_policy.AdminAccessPolicy will be created
  + resource "azuread_conditional_access_policy" "AdminAccessPolicy" {
      + display_name = "AdminAccessPolicy"
      + id           = (known after apply)
      + state        = "enabled"

      + conditions {
          + client_app_types    = [
              + "all",
            ]
          + sign_in_risk_levels = [
              + "high",
            ]
          + user_risk_levels    = [
              + "high",
            ]

          + applications {
              + excluded_applications = []
              + included_applications = [
                  + "All",
                ]
            }

          + locations {
              + included_locations = [
                  + "All",
                ]
            }

          + platforms {
              + included_platforms = [
                  + "All",
                ]
            }

          + users {
              + included_groups = (known after apply)
            }
        }

      + grant_controls {
          + built_in_controls = [
              + "mfa",
            ]
          + operator          = "OR"
        }
    }

  # azuread_directory_role.GlobalAdmin will be created
  + resource "azuread_directory_role" "GlobalAdmin" {
      + description  = (known after apply)
      + display_name = "Global Administrator"
      + id           = (known after apply)
      + object_id    = (known after apply)
      + template_id  = (known after apply)
    }

  # azuread_directory_role_assignment.GlobalAdmin will be created
  + resource "azuread_directory_role_assignment" "GlobalAdmin" {
      + app_scope_id              = (known after apply)
      + app_scope_object_id       = (known after apply)
      + directory_scope_id        = (known after apply)
      + directory_scope_object_id = (known after apply)
      + id                        = (known after apply)
      + principal_object_id       = (known after apply)
      + role_id                   = (known after apply)
    }

  # azuread_group.AF will be created
  + resource "azuread_group" "AF" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "Administratif"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # azuread_group.IT will be created
  + resource "azuread_group" "IT" {
      + assignable_to_role             = true
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "IT"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # azuread_user.AF-4 will be created
  + resource "azuread_user" "AF-4" {
      + about_me                       = (known after apply)
      + account_enabled                = true
      + business_phones                = (known after apply)
      + company_name                   = "CPE"
      + creation_type                  = (known after apply)
      + department                     = "Administratif"
      + disable_password_expiration    = false
      + disable_strong_password        = false
      + display_name                   = "Barack Afritt"
      + external_user_state            = (known after apply)
      + force_password_change          = false
      + id                             = (known after apply)
      + im_addresses                   = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = "barack.afritt"
      + object_id                      = (known after apply)
      + onpremises_distinguished_name  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_immutable_id        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + onpremises_user_principal_name = (known after apply)
      + password                       = (sensitive value)
      + proxy_addresses                = (known after apply)
      + show_in_address_list           = true
      + user_principal_name            = "barack.afritt@AxFrancoiscpe.onmicrosoft.com"
      + user_type                      = (known after apply)
    }

  # azuread_user.AF-5 will be created
  + resource "azuread_user" "AF-5" {
      + about_me                       = (known after apply)
      + account_enabled                = true
      + business_phones                = (known after apply)
      + company_name                   = "CPE"
      + creation_type                  = (known after apply)
      + department                     = "Administratif"
      + disable_password_expiration    = false
      + disable_strong_password        = false
      + display_name                   = "Annie-Zette Auffray"
      + external_user_state            = (known after apply)
      + force_password_change          = false
      + id                             = (known after apply)
      + im_addresses                   = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = "annie-zette.auffray"
      + object_id                      = (known after apply)
      + onpremises_distinguished_name  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_immutable_id        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + onpremises_user_principal_name = (known after apply)
      + password                       = (sensitive value)
      + proxy_addresses                = (known after apply)
      + show_in_address_list           = true
      + user_principal_name            = "annie-zette.auffray@AxFrancoiscpe.onmicrosoft.com"
      + user_type                      = (known after apply)
    }

  # azuread_user.IT-1 will be created
  + resource "azuread_user" "IT-1" {
      + about_me                       = (known after apply)
      + account_enabled                = true
      + business_phones                = (known after apply)
      + company_name                   = "CPE"
      + creation_type                  = (known after apply)
      + department                     = "IT"
      + disable_password_expiration    = false
      + disable_strong_password        = false
      + display_name                   = "Jean Cive"
      + external_user_state            = (known after apply)
      + force_password_change          = false
      + id                             = (known after apply)
      + im_addresses                   = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = "jean.cive"
      + object_id                      = (known after apply)
      + onpremises_distinguished_name  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_immutable_id        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + onpremises_user_principal_name = (known after apply)
      + password                       = (sensitive value)
      + proxy_addresses                = (known after apply)
      + show_in_address_list           = true
      + user_principal_name            = "jean.cive@AxFrancoiscpe.onmicrosoft.com"
      + user_type                      = (known after apply)
    }

  # azuread_user.IT-2 will be created
  + resource "azuread_user" "IT-2" {
      + about_me                       = (known after apply)
      + account_enabled                = true
      + business_phones                = (known after apply)
      + company_name                   = "CPE"
      + creation_type                  = (known after apply)
      + department                     = "IT"
      + disable_password_expiration    = false
      + disable_strong_password        = false
      + display_name                   = "Sarah Croche"
      + external_user_state            = (known after apply)
      + force_password_change          = false
      + id                             = (known after apply)
      + im_addresses                   = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = "sara.croche"
      + object_id                      = (known after apply)
      + onpremises_distinguished_name  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_immutable_id        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + onpremises_user_principal_name = (known after apply)
      + password                       = (sensitive value)
      + proxy_addresses                = (known after apply)
      + show_in_address_list           = true
      + user_principal_name            = "sarah.croche@AxFrancoiscpe.onmicrosoft.com"
      + user_type                      = (known after apply)
    }

  # azuread_user.IT-3 will be created
  + resource "azuread_user" "IT-3" {
      + about_me                       = (known after apply)
      + account_enabled                = true
      + business_phones                = (known after apply)
      + company_name                   = "CPE"
      + creation_type                  = (known after apply)
      + department                     = "IT"
      + disable_password_expiration    = false
      + disable_strong_password        = false
      + display_name                   = "Hubert Bonisseur-Delabath"
      + external_user_state            = (known after apply)
      + force_password_change          = false
      + id                             = (known after apply)
      + im_addresses                   = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = "hubert.bonisseur-delabath"
      + object_id                      = (known after apply)
      + onpremises_distinguished_name  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_immutable_id        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + onpremises_user_principal_name = (known after apply)
      + password                       = (sensitive value)
      + proxy_addresses                = (known after apply)
      + show_in_address_list           = true
      + user_principal_name            = "hubert.bonisseur-delabath@AxFrancoiscpe.onmicrosoft.com"
      + user_type                      = (known after apply)
    }

  # azurerm_backup_policy_vm.ProductionVM1-backup-policy will be created
  + resource "azurerm_backup_policy_vm" "ProductionVM1-backup-policy" {
      + id                             = (known after apply)
      + instant_restore_retention_days = (known after apply)
      + name                           = "ProductionVM1-backup-policy"
      + policy_type                    = "V1"
      + recovery_vault_name            = "ConfidentialRecoveryVault"
      + resource_group_name            = "CPE-POC"
      + timezone                       = "UTC+2"

      + backup {
          + frequency = "Daily"
          + time      = "23:00"
        }

      + retention_daily {
          + count = 30
        }
    }

  # azurerm_key_vault.KeyVault1 will be created
  + resource "azurerm_key_vault" "KeyVault1" {
      + access_policy                 = [
          + {
              + key_permissions     = [
                  + "Get",
                ]
              + object_id           = "f1b2a0c0-6321-498f-b859-68b6f89f234b"
              + secret_permissions  = [
                  + "Get",
                ]
              + storage_permissions = [
                  + "Get",
                ]
              + tenant_id           = "ce4775d3-1c2e-4644-b2bc-631c157d2be7"
            },
        ]
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "francecentral"
      + name                          = "KeyVault1"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "CPE-POC"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "ce4775d3-1c2e-4644-b2bc-631c157d2be7"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_access_policy.example will be created
  + resource "azurerm_key_vault_access_policy" "example" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = "f1b2a0c0-6321-498f-b859-68b6f89f234b"
      + secret_permissions = [
          + "Get",
        ]
      + tenant_id          = "ce4775d3-1c2e-4644-b2bc-631c157d2be7"
    }

  # azurerm_network_interface.JumpStationVM1-NIC will be created
  + resource "azurerm_network_interface" "JumpStationVM1-NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "francecentral"
      + mac_address                   = (known after apply)
      + name                          = "JumpStationVM1-NIC"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "CPE-POC"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "PrimaryIP"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_interface.ProductionVM1-NIC will be created
  + resource "azurerm_network_interface" "ProductionVM1-NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "francecentral"
      + mac_address                   = (known after apply)
      + name                          = "ProductionVM1-NIC"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "CPE-POC"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "PrimaryIP"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_security_group.JumpStationSecurityGroup will be created
  + resource "azurerm_network_security_group" "JumpStationSecurityGroup" {
      + id                  = (known after apply)
      + location            = "francecentral"
      + name                = "JumpStationSecurityGroup"
      + resource_group_name = "CPE-POC"
      + security_rule       = (known after apply)
    }

  # azurerm_network_security_rule.JumpStationSecurityRule-1 will be created
  + resource "azurerm_network_security_rule" "JumpStationSecurityRule-1" {
      + access                      = "Allow"
      + destination_address_prefix  = "Internet"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Allow traffic to internet"
      + network_security_group_name = "JumpStationSecurityGroup"
      + priority                    = 101
      + protocol                    = "*"
      + resource_group_name         = "CPE-POC"
      + source_address_prefix       = (known after apply)
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.JumpStationSecurityRule-2 will be created
  + resource "azurerm_network_security_rule" "JumpStationSecurityRule-2" {
      + access                      = "Allow"
      + destination_address_prefix  = (known after apply)
      + destination_port_range      = "3389"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow only RDP traffic from CPE network"
      + network_security_group_name = "JumpStationSecurityGroup"
      + priority                    = 102
      + protocol                    = "*"
      + resource_group_name         = "CPE-POC"
      + source_address_prefix       = "134.214.58.61"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.JumpStationSecurityRule-3 will be created
  + resource "azurerm_network_security_rule" "JumpStationSecurityRule-3" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.0.0.0/16"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Allow traffic to internal network"
      + network_security_group_name = "JumpStationSecurityGroup"
      + priority                    = 103
      + protocol                    = "*"
      + resource_group_name         = "CPE-POC"
      + source_address_prefix       = "192.168.0.0/24"
      + source_port_range           = "*"
    }

  # azurerm_public_ip.PublicIP-1 will be created
  + resource "azurerm_public_ip" "PublicIP-1" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "francecentral"
      + name                    = "PublicIP-1"
      + resource_group_name     = "CPE-POC"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + tags                    = {
          + "environment" = "System"
        }
    }

  # azurerm_recovery_services_vault.ConfidentialRecoveryVault will be created
  + resource "azurerm_recovery_services_vault" "ConfidentialRecoveryVault" {
      + classic_vmware_replication_enabled = (known after apply)
      + cross_region_restore_enabled       = false
      + id                                 = (known after apply)
      + immutability                       = (known after apply)
      + location                           = "francecentral"
      + name                               = "ConfidentialRecoveryVault"
      + public_network_access_enabled      = true
      + resource_group_name                = "CPE-POC"
      + sku                                = "Standard"
      + soft_delete_enabled                = true
      + storage_mode_type                  = "GeoRedundant"
    }

  # azurerm_resource_group.RG_CPE will be created
  + resource "azurerm_resource_group" "RG_CPE" {
      + id       = (known after apply)
      + location = "francecentral"
      + name     = "CPE-POC"
    }

  # azurerm_storage_account.ConfidentielStorageAccount will be created
  + resource "azurerm_storage_account" "ConfidentielStorageAccount" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "francecentral"
      + min_tls_version                   = "TLS1_2"
      + name                              = (known after apply)
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = false
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "CPE-POC"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
    }

  # azurerm_storage_share.CondidentialServices-share-1 will be created
  + resource "azurerm_storage_share" "CondidentialServices-share-1" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "confidentiel"
      + quota                = 250
      + resource_manager_id  = (known after apply)
      + storage_account_name = (known after apply)
      + url                  = (known after apply)
    }

  # azurerm_subnet.CondidentialServices-network-1-subnet-1 will be created
  + resource "azurerm_subnet" "CondidentialServices-network-1-subnet-1" {
      + address_prefixes                               = [
          + "10.0.0.0/16",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "CondidentialServices-network-1-subnet-1"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "CPE-POC"
      + virtual_network_name                           = "CondidentialServices-network-1"
    }

  # azurerm_subnet.System-network-1-subnet-1 will be created
  + resource "azurerm_subnet" "System-network-1-subnet-1" {
      + address_prefixes                               = [
          + "192.168.0.0/25",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "System-network-1-subnet-1"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "CPE-POC"
      + virtual_network_name                           = "System-network-1"
    }

  # azurerm_subnet.System-network-1-subnet-2 will be created
  + resource "azurerm_subnet" "System-network-1-subnet-2" {
      + address_prefixes                               = [
          + "192.168.0.128/25",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "System-network-1-subnet-2"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "CPE-POC"
      + virtual_network_name                           = "System-network-1"
    }

  # azurerm_virtual_machine.JumpStationVM1 will be created
  + resource "azurerm_virtual_machine" "JumpStationVM1" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "francecentral"
      + name                             = "JumpStationVM1"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "CPE-POC"
      + tags                             = {
          + "environment" = "System"
        }
      + vm_size                          = "Standard_B2s"

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
        }

      + storage_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "osdisk1"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # azurerm_virtual_machine.ProductionVM1 will be created
  + resource "azurerm_virtual_machine" "ProductionVM1" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "francecentral"
      + name                             = "ProductionVM1"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "CPE-POC"
      + tags                             = {
          + "environment" = "System"
        }
      + vm_size                          = "Standard_B2s"

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
        }

      + storage_image_reference {
          + offer     = "WindowsServer"
          + publisher = "Windows"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "osdisk1"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # azurerm_virtual_network.CondidentialServices-network-1 will be created
  + resource "azurerm_virtual_network" "CondidentialServices-network-1" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "francecentral"
      + name                = "CondidentialServices-network-1"
      + resource_group_name = "CPE-POC"
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "CondidentialServices"
        }
    }

  # azurerm_virtual_network.System-network-1 will be created
  + resource "azurerm_virtual_network" "System-network-1" {
      + address_space       = [
          + "192.168.0.0/24",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "francecentral"
      + name                = "System-network-1"
      + resource_group_name = "CPE-POC"
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "System"
        }
    }

  # azurerm_virtual_network_peering.ConfidentialServicesToSystem will be created
  + resource "azurerm_virtual_network_peering" "ConfidentialServicesToSystem" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "ConfidentialServicesToSystem"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "CPE-POC"
      + use_remote_gateways          = false
      + virtual_network_name         = "CondidentialServices-network-1"
    }

  # azurerm_virtual_network_peering.SystemToConfidentialServices will be created
  + resource "azurerm_virtual_network_peering" "SystemToConfidentialServices" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "SystemToConfidentialServices"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "CPE-POC"
      + use_remote_gateways          = false
      + virtual_network_name         = "System-network-1"
    }

  # random_string.resource_code will be created
  + resource "random_string" "resource_code" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 34 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @AxFrancois, Action: `pull_request`, Workflow: `Terraform Plan`*